# Getting started with pandas

In [16]:
from pandas import Series, DataFrame
import pandas as pd

In [17]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

'c:\\pydev\\pydata-book-master'

## Introduction to pandas data structures

### Series

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [10]:
obj2['d'] = 6
obj2['d']

6

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [ ]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

In [ ]:
obj3

In [ ]:
obj4

In [ ]:
obj3 + obj4

In [ ]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

In [ ]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

### DataFrame

In [ ]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [ ]:
# 사전으로 주면 컬럼명이 순서대로 나온다.

In [ ]:
frame

In [ ]:
DataFrame(data, columns=['year', 'state', 'pop'])

In [ ]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

In [ ]:
frame2.columns

In [ ]:
frame2['state']

In [ ]:
frame2.year

In [ ]:
frame2.ix['three']

In [ ]:
frame2['debt'] = 16.5
frame2

In [ ]:
frame2['debt'] = np.arange(5.)
frame2

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

In [ ]:
del frame2['eastern']
frame2.columns

In [ ]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [ ]:
frame3 = DataFrame(pop)
frame3

In [ ]:
frame3.T

In [ ]:
DataFrame(pop, index=[2001, 2002, 2003])

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index objects

In [ ]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

In [ ]:
index[1:]

In [ ]:
index[1] = 'd'

In [ ]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

In [ ]:
frame3

In [ ]:
'Ohio' in frame3.columns

In [ ]:
2003 in frame3.index

## Essential functionality

### Reindexing

In [18]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [19]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [20]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [21]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [22]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [23]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [24]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [25]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [1]:
#column으로 reindex를 할 수도 있다. 없는 값이 추가되면, 값은 NaN으로 나타난다.

In [26]:
frame.reindex(index=['a', 'b', 'c', 'd'],
              columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [27]:
frame.ix[['a', 'b', 'c', 'd'], states]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [2]:
# row는 인덱스, 컬럼은 states

### Dropping entries from an axis

In [7]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e']); obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [8]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [ ]:
# drop이라는 method를 이용해서 ,

In [9]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [10]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [11]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [13]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [15]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd']); obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [14]:
obj['b']

1.0

In [16]:
obj[1]

1.0

In [17]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [18]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [19]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [31]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [32]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [ ]:
# 레이블로 슬라이싱 할때는 마지막 원소가 포함된다.

In [33]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [34]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [36]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [37]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [38]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [39]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
# data frame에 스칼라 값이 적용된다.

In [21]:
data[data < 5] = 0

In [22]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
data.ix['Colorado', ['two', 'three']]

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [43]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [23]:
data.ix[2]

C:\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [24]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [25]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [26]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [27]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [28]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [29]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [ ]:
# 레이블끼리의 연산
# 레이블이 있다.

In [18]:
from IPython.core.interactiveshell import InteractiveShell

In [19]:
InteractiveShell.ast_node_interactivity = 'all'

In [ ]:
# 함수를 한번에 계산활 수 있도록 해준다.

In [20]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [21]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [22]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [23]:
list('hello')

['h', 'e', 'l', 'l', 'o']

In [30]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [25]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [27]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
# data frame 1에 없는 값을 0으로 채운 후 , df2와 더해라
# 결과에 대해서 채우는게 아니라, 값을 0으로 두고 작업

In [29]:
df1.reindex(columns=df2.columns)
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [ ]:
# dataframe 1에 대한 작업
# 남는 작업에 대해서 결과를 0으로 한다.

In [ ]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

In [31]:
df1.reindex(index=df2.index, columns=df2.columns)

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN
3  NaN  NaN   NaN   NaN NaN

In [32]:
df1.reindex(index=df2.index, columns=df2.columns, fill_value=0)

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

#### Operations between DataFrame and Series

In [33]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [34]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [35]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [ ]:
# - 이차원 배열에서 일차원 배열을 빼면 row 단위로 된다.

In [37]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame.loc['Utah']
series
frame

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
# iloc는 인덱스라는

In [38]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [39]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [40]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [42]:
series3 = frame['d']
frame
series3

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [55]:
frame - series3
#dataframe에서 연산은, column을 기준으로 된다. 
#dataframe에서 utah를 찾았다. 그 결과 
#dataframe, series 연산을 column에 맞춰서 한다. 
#이건 잘 못 된 계산
#특이하게 axis=1이 기본값이 되었다. 기본은 axis=0이 기본값~!

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [59]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [ ]:
# 이렇게 하면 원래 원하는 겨과가 나온다

In [60]:
frame.sub(series3, axis=1)
#column이 기준이 된다.

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function application and mapping

In [43]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [44]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [45]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [66]:
f = lambda x: x.max() - x.min()
f

함수(사용자 정의 함수, 다른 함수)를 row전체 column 전체를 적용하려고 할때 apply함수를 사용한다.

In [67]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [70]:
frame.apply(f, axis=1)

             min       max
Utah   -0.519439  0.478943
Ohio   -0.555730  1.965781
Texas   0.092908  0.769023
Oregon -1.296221  1.246435

In [71]:
frame.apply(f, axis=1).T

         Utah      Ohio     Texas    Oregon
min -0.519439 -0.555730  0.092908 -1.296221
max  0.478943  1.965781  0.769023  1.246435

In [47]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [48]:
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [52]:
frame.apply(f).T

        min       max
b -0.555730  1.246435
d  0.281746  1.965781
e -1.296221  1.393406

In [54]:
frame.apply(f, axis=0).T

        min       max
b -0.555730  1.246435
d  0.281746  1.965781
e -1.296221  1.393406

default값이 ***하나의 column***에 대한 row를 계산한다고 할 수 있다. 
database에서 sum을 생각해보았을 때 , 기본적으로 row를 더해 집계를 낸다.

In [53]:
frame.apply(f, axis=1).T

         Utah      Ohio     Texas    Oregon
min -0.519439 -0.555730  0.092908 -1.296221
max  0.478943  1.965781  0.769023  1.246435

각 row에 대해서 columns을 비교해 min, max를 살펴보았다.

In [55]:
format = lambda x: '%.2f' % x

In [56]:
frame.applymap(format)
#row나 column

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [57]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [59]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [58]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [60]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [76]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

index는 row를 뜻한다고 볼 수 있다.

In [61]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [62]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

기본적으로는 오름차순이기 때문에 ascending=False를 준다.

In [63]:
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [64]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [65]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [69]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [70]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [71]:
obj = Series([7, -5, 7, 4, 2, 0, 4]); obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [72]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

동률처리를 평균값으로 한다. 
예를 들어 4가 두개가 있을때, 4,5위 인데 4.5위가 된다.

In [73]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [74]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [75]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [77]:
frame.rank(axis=0)

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [76]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [79]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [80]:
obj.index.is_unique

False

In [81]:
obj['a']

a    0
a    1
dtype: int32

In [82]:
obj['c']

4

In [83]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [84]:
df.loc['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

INDEX가 있다면 loc가 편하다

In [86]:
df.iloc[2:4]

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [87]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

파이썬의 기본자료형이 리스트안에 리스트가 있는 개념이다.

In [88]:
df.sum()

one    9.25
two   -5.80
dtype: float64

판다스이 dataframe은 null값을 제외하고 적용된다. 
기본값이 column이여서 컬럼별로 집계가 나온다.

In [89]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [90]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [91]:
df.idxmax()

one    b
two    d
dtype: object

값 중에서 최대값을 리턴 후, 거기에 해당하는 index를 리턴한다.

In [93]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [94]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [95]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

명목데이터는 수치값과 다르게 취급해준다.<br/>
count, unique, top, freq
describe는 명목데이터와 수치데이터에 따르게 다르게 작동한다.

### Correlation and covariance

In [101]:
#import pandas.io.data as web
import pandas_datareader as web
# from pandas_datareader import get_data_yahoo

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
all_data

{'AAPL':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04   30.490000   30.642857   30.340000   30.572857   27.505054
 2010-01-05   30.657143   30.798571   30.464285   30.625713   27.552608
 2010-01-06   30.625713   30.747143   30.107143   30.138571   27.114347
 2010-01-07   30.250000   30.285715   29.864286   30.082857   27.064222
 2010-01-08   30.042856   30.285715   29.865715   30.282858   27.244156
 2010-01-11   30.400000   30.428572   29.778572   30.015715   27.003820
 2010-01-12   29.884285   29.967142   29.488571   29.674286   26.696650
 2010-01-13   29.695715   30.132856   29.157143   30.092857   27.073221
 2010-01-14   30.015715   30.065714   29.860001   29.918571   26.916422
 2010-01-15   30.132856   30.228571   29.410000   29.418571   26.466595
 2010-01-19   29.761429   30.741428   29.605715   30.719999   27.637430
 2010-01-20   30.701429   30.792856   29.928572   30.247143   27.212029
 2010-01-21   30.297142   30.472857   29.601429   29.724285   26.741631
 2010-01-22   29.540001   29.642857   28.165714   28.250000   25.415281
 2010-01-25   28.930000   29.242857   28.598572   29.010000   26.099028
 2010-01-26   29.421429   30.530001   28.940001   29.420000   26.467880
 2010-01-27   29.549999   30.082857   28.504286   29.697144   26.717218
 2010-01-28   29.275715   29.357143   28.385714   28.469999   25.613209
 2010-01-29   28.725714   28.885714   27.178572   27.437143   24.683992
 2010-02-01   27.481428   28.000000   27.328571   27.818571   25.027143
 2010-02-02   27.987143   28.045713   27.625713   27.980000   25.172379
 2010-02-03   27.881428   28.600000   27.774286   28.461428   25.605494
 2010-02-04   28.104286   28.338572   27.367144   27.435715   24.682707
 2010-02-05   27.518572   28.000000   27.264286   27.922857   25.120964
 2010-02-08   27.955715   28.268572   27.714285   27.731428   24.948748
 2010-02-09   28.059999   28.214285   27.821428   28.027143   25.214790
 2010-02-10   27.984285   28.085714   27.751429   27.874287   25.077271
 2010-02-11   27.840000   28.535715   27.722857   28.381428   25.533520
 2010-02-12   28.301428   28.805714   27.928572   28.625713   25.753294
 2010-02-16   28.848572   29.098572   28.788572   29.057142   26.141434
 ...                ...         ...         ...         ...         ...
 2017-07-24  150.580002  152.440002  149.899994  152.089996  151.495071
 2017-07-25  151.800003  153.839996  151.800003  152.740005  152.142548
 2017-07-26  153.350006  153.929993  153.059998  153.460007  152.859726
 2017-07-27  153.750000  153.990005  147.300003  150.559998  149.971069
 2017-07-28  149.889999  150.229996  149.190002  149.500000  148.915207
 2017-07-31  149.899994  150.330002  148.130005  148.729996  148.148224
 2017-08-01  149.100006  150.220001  148.410004  150.050003  149.463058
 2017-08-02  159.279999  159.750000  156.160004  157.139999  156.525330
 2017-08-03  157.050003  157.210007  155.020004  155.570007  154.961472
 2017-08-04  156.070007  157.399994  155.690002  156.389999  155.778259
 2017-08-07  157.059998  158.919998  156.669998  158.809998  158.188797
 2017-08-08  158.600006  161.830002  158.270004  160.080002  159.453827
 2017-08-09  159.259995  161.270004  159.110001  161.059998  160.429993
 2017-08-10  159.899994  160.000000  154.630005  155.320007  155.320007
 2017-08-11  156.600006  158.570007  156.070007  157.479996  157.479996
 2017-08-14  159.320007  160.210007  158.750000  159.850006  159.850006
 2017-08-15  160.660004  162.199997  160.139999  161.600006  161.600006
 2017-08-16  161.940002  162.509995  160.149994  160.949997  160.949997
 2017-08-17  160.520004  160.710007  157.839996  157.860001  157.860001
 2017-08-18  157.860001  159.500000  156.720001  157.500000  157.500000
 2017-08-21  157.500000  157.889999  155.110001  157.210007  157.210007
 2017-08-22  158.229996  160.000000  158.020004  159.779999  159.779999
 2017-08-23  159.070007  160.470001  158.880005  159.979996  159.979996
 2017-08-24  160.429993  160.740005  158.550003  159.270004  159.270004
 2017-08-25  159.649994  160.559998  159.270004  159.860001  159.860001
 2017-08-28  160.139999  162.000000  159.929993  161.470001  161.470001
 2017-08-29  160.100006  163.119995  160.000000  162.910004  162.910004
 2017-08-30  163.800003  163.889999  162.610001  163.350006  163.350006
 2017-08-31  163.639999  164.520004  163.479996  164.000000  164.000000
 2017-09-01  164.800003  164.940002  163.630005  164.050003  164.050003

                Volume
 Date
 2010-01-04  123432400
 2010-01-05  150476200
 2010-01-06  138040000
 2010-01-07  119282800
 2010-01-08  111902700
 2010-01-11  115557400
 2010-01-12  148614900
 2010-01-13  151473000
 2010-01-14  108223500
 2010-01-15  148516900
 2010-01-19  182501900
 2010-01-20  153038200
 2010-01-21  152038600
 2010-01-22  220441900
 2010-01-25  266424900
 2010-01-26  466777500
 2010-01-27  430642100
 2010-01-28  293375600
 2010-01-29  311488100
 2010-02-01  187469100
 2010-02-02  174585600
 2010-02-03  153832000
 2010-02-04  189413000
 2010-02-05  212576700
 2010-02-08  119567700
 2010-02-09  158221700
 2010-02-10   92590400
 2010-02-11  137586400
 2010-02-12  163867200
 2010-02-16  135934400
 ...               ...
 2017-07-24   21493200
 2017-07-25   18853900
 2017-07-26   15781000
 2017-07-27   32476300
 2017-07-28   17213700
 2017-07-31   19845900
 2017-08-01   35368600
 2017-08-02   69936800
 2017-08-03   27097300
 2017-08-04   20559900
 2017-08-07   21870300
 2017-08-08   36205900
 2017-08-09   26131500
 2017-08-10   40804300
 2017-08-11   26257100
 2017-08-14   22028200
 2017-08-15   29465500
 2017-08-16   27671600
 2017-08-17   27940600
 2017-08-18   27428100
 2017-08-21   26368500
 2017-08-22   21604600
 2017-08-23   19399100
 2017-08-24   19818900
 2017-08-25   25480100
 2017-08-28   25966000
 2017-08-29   29516900
 2017-08-30   27269600
 2017-08-31   26785100
 2017-09-01   16552800

 [1931 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04  312.304413  313.579620  310.954468  312.204773  312.204773
 2010-01-05  312.418976  312.747742  309.609497  310.829926  310.829926
 2010-01-06  311.761444  311.761444  302.047852  302.994293  302.994293
 2010-01-07  303.562164  303.861053  295.218445  295.940735  295.940735
 2010-01-08  294.894653  300.498657  293.455048  299.885956  299.885956
 2010-01-11  301.101410  301.101410  295.910858  299.432648  299.432648
 2010-01-12  297.709106  297.963165  292.902130  294.137512  294.137512
 2010-01-13  287.168610  293.091431  285.878448  292.448822  292.448822
 2010-01-14  290.859772  295.990540  290.316833  293.823669  293.823669
 2010-01-15  295.562164  295.671753  287.940735  288.917053  288.917053
 2010-01-19  289.514832  294.107605  287.069000  292.712830  292.712830
 2010-01-20  291.895905  291.895905  286.570862  289.121307  289.121307
 2010-01-21  290.630646  292.314331  285.056549  290.401489  290.401489
 2010-01-22  281.196014  284.234619  266.431335  273.978058  273.978058
 2010-01-25  272.274445  273.913300  266.755127  268.991760  268.991760
 2010-01-26  267.980530  273.773834  267.143677  270.197235  270.197235
 2010-01-27  269.624390  272.802460  266.655518  270.037842  270.037842
 2010-01-28  271.228363  272.478668  264.309296  266.147400  266.147400
 2010-01-29  268.239563  269.484894  261.823608  263.980530  263.980530
 2010-02-01  266.301849  266.904572  264.159851  265.514771  265.514771
 2010-02-02  266.481171  266.481171  262.819885  264.568329  264.568329
 2010-02-03  263.347900  270.037842  263.128723  269.400208  269.400208
 2010-02-04  267.497345  267.995483  261.798706  262.406433  262.406433
 2010-02-05  263.213409  265.753876  260.254517  264.653015  264.653015
 2010-02-08  265.255768  269.988007  264.772552  265.738953  265.738953
 2010-02-09  268.762604  269.753906  266.535950  267.218414  267.218414
 2010-02-10  266.037811  267.890869  262.859741  266.227112  266.227112
 2010-02-11  265.664215  269.235840  263.761353  267.198486  267.198486
 2010-02-12  265.489868  267.572083  264.259491  265.564606  265.564606
 2010-02-16  267.432587  271.049042  266.152405  269.639313  269.639313
 ...                ...         ...         ...         ...         ...
 2017-07-24  972.219971  986.200012  970.770020  980.340027  980.340027
 2017-07-25  953.809998  959.700012  945.400024  950.700012  950.700012
 2017-07-26  954.679993  955.000000  942.278992  947.799988  947.799988
 2017-07-27  951.780029  951.780029  920.000000  934.090027  934.090027
 2017-07-28  929.400024  943.830017  927.500000  941.530029  941.530029
 2017-07-31  941.890015  943.590027  926.039978  930.500000  930.500000
 2017-08-01  932.380005  937.447021  929.260010  930.830017  930.830017
 2017-08-02  928.609985  932.599976  916.679993  930.390015  930.390015
 2017-08-03  930.340027  932.239990  922.239990  923.650024  923.650024
 2017-08-04  926.750000  930.307007  923.030029  927.960022  927.960022
 2017-08-07  929.059998  931.700012  926.500000  929.359985  929.359985
 2017-08-08  927.090027  935.814026  925.609985  926.789978  926.789978
 2017-08-09  920.609985  925.979980  917.250000  922.900024  922.900024
 2017-08-10  917.549988  919.260010  906.130005  907.239990  907.239990
 2017-08-11  907.969971  917.780029  905.580017  914.390015  914.390015
 2017-08-14  922.530029  924.668030  918.190002  922.669983  922.669983
 2017-08-15  924.229980  926.549988  919.820007  922.219971  922.219971
 2017-08-16  925.289978  932.700012  923.445007  926.960022  926.960022
 2017-08-17  925.780029  926.859985  910.979980  910.979980  910.979980
 2017-08-18  910.309998  915.275024  907.153992  910.669983  910.669983
 2017-08-21  910.000000  913.000000  903.400024  906.659973  906.659973
 2017-08-22  912.719971  925.859985  911.474976  924.690002  924.690002
 2017-08-23  921.929993  929.929993  919.359985  927.000000  927.000000
 2017-08-24  928.659973  930.840027  915.500000  921.280029  921.280029
 2017-08-25  923.489990  925.554993  915.500000  915.890015  915.890015
 2017-08-28  916.000000  919.244995  911.869995  913.809998  913.809998
 2017-08-29  905.099976  923.330017  905.000000  921.289978  921.289978
 2017-08-30  920.049988  930.818970  919.650024  929.570007  929.570007
 2017-08-31  931.760010  941.979980  931.760010  939.330017  939.330017
 2017-09-01  941.130005  942.479980  935.150024  937.340027  937.340027

               Volume
 Date
 2010-01-04   3927000
 2010-01-05   6031900
 2010-01-06   7987100
 2010-01-07  12876600
 2010-01-08   9483900
 2010-01-11  14479800
 2010-01-12   9742900
 2010-01-13  13041800
 2010-01-14   8511900
 2010-01-15  10909600
 2010-01-19   8665700
 2010-01-20   6525700
 2010-01-21  12662600
 2010-01-22  13651700
 2010-01-25   8872800
 2010-01-26   8743600
 2010-01-27   7958400
 2010-01-28   6482300
 2010-01-29   8311900
 2010-02-01   4518400
 2010-02-02   8223000
 2010-02-03   6020500
 2010-02-04   6780600
 2010-02-05   6335600
 2010-02-08   5408700
 2010-02-09   5660200
 2010-02-10   5369000
 2010-02-11   4838000
 2010-02-12   4576400
 2010-02-16   7336100
 ...              ...
 2017-07-24   3248300
 2017-07-25   4661000
 2017-07-26   2088300
 2017-07-27   3213000
 2017-07-28   1846400
 2017-07-31   1970100
 2017-08-01   1277700
 2017-08-02   1824400
 2017-08-03   1202500
 2017-08-04   1082300
 2017-08-07   1032200
 2017-08-08   1061600
 2017-08-09   1192100
 2017-08-10   1824000
 2017-08-11   1206800
 2017-08-14   1064500
 2017-08-15    883400
 2017-08-16   1006700
 2017-08-17   1277200
 2017-08-18   1342700
 2017-08-21    943400
 2017-08-22   1166700
 2017-08-23   1090200
 2017-08-24   1270300
 2017-08-25   1053400
 2017-08-28   1086500
 2017-08-29   1185600
 2017-08-30   1301200
 2017-08-31   1582600
 2017-09-01    915900

 [1931 rows x 6 columns],
 'IBM':                   Open        High         Low       Close   Adj Close  \
 Date
 2010-01-04  131.179993  132.970001  130.850006  132.449997  109.173752
 2010-01-05  131.679993  131.850006  130.100006  130.850006  107.854950
 2010-01-06  130.679993  131.490005  129.809998  130.000000  107.154320
 2010-01-07  129.869995  130.250000  128.910004  129.550003  106.783417
 2010-01-08  129.070007  130.919998  129.050003  130.850006  107.854950
 2010-01-11  131.059998  131.059998  128.669998  129.479996  106.725700
 2010-01-12  129.029999  131.330002  129.000000  130.509995  107.574692
 2010-01-13  130.389999  131.119995  129.160004  130.229996  107.343887
 2010-01-14  130.550003  132.710007  129.910004  132.309998  109.058350
 2010-01-15  132.029999  132.889999  131.089996  131.779999  108.621490
 2010-01-19  131.630005  134.250000  131.559998  134.139999  110.566757
 2010-01-20  130.460007  131.149994  128.949997  130.250000  107.360382
 2010-01-21  130.470001  130.690002  128.059998  129.000000  106.330040
 2010-01-22  128.669998  128.889999  125.370003  125.500000  103.445122
 2010-01-25  126.330002  126.889999  125.709999  126.120003  103.956169
 2010-01-26  125.919998  127.750000  125.410004  125.750000  103.651207
 2010-01-27  125.820000  126.959999  125.040001  126.330002  104.129272
 2010-01-28  127.029999  127.040001  123.050003  123.750000  102.002670
 2010-01-29  124.320000  125.000000  121.900002  122.389999  100.881660
 2010-02-01  123.230003  124.949997  122.779999  124.669998  102.760971
 2010-02-02  124.790001  125.809998  123.949997  125.529999  103.469849
 2010-02-03  125.160004  126.070000  125.070000  125.660004  103.577019
 2010-02-04  125.190002  125.440002  122.900002  123.000000  101.384453
 2010-02-05  123.040001  123.720001  121.830002  123.519997  101.813095
 2010-02-08  123.150002  123.220001  121.739998  121.879997  100.910622
 2010-02-09  122.650002  124.199997  122.459999  123.209999  102.011803
 2010-02-10  122.940002  123.650002  122.209999  122.809998  101.680611
 2010-02-11  122.580002  124.199997  122.059998  123.730003  102.442314
 2010-02-12  123.010002  124.050003  121.610001  124.000000  102.665886
 2010-02-16  124.910004  125.230003  124.110001  125.230003  103.684265
 ...                ...         ...         ...         ...         ...
 2017-07-24  147.000000  147.039993  145.800003  145.990005  144.463654
 2017-07-25  146.570007  147.490005  146.029999  146.190002  144.661560
 2017-07-26  146.270004  146.460007  144.470001  145.360001  143.840240
 2017-07-27  145.000000  145.399994  143.639999  145.070007  143.553284
 2017-07-28  144.809998  145.039993  143.839996  144.289993  142.781418
 2017-07-31  144.380005  144.929993  144.169998  144.669998  143.157455
 2017-08-01  145.000000  145.669998  144.720001  145.300003  143.780869
 2017-08-02  145.119995  145.289993  144.220001  144.449997  142.939758
 2017-08-03  144.429993  145.339996  144.429993  144.940002  143.424637
 2017-08-04  145.000000  145.389999  144.399994  145.160004  143.642334
 2017-08-07  145.000000  145.089996  142.750000  143.470001  141.970001
 2017-08-08  142.000000  142.759995  142.000000  142.110001  142.110001
 2017-08-09  141.750000  142.029999  141.190002  141.770004  141.770004
 2017-08-10  141.639999  142.419998  141.229996  141.839996  141.839996
 2017-08-11  142.449997  142.589996  141.520004  141.839996  141.839996
 2017-08-14  142.000000  142.759995  141.940002  142.320007  142.320007
 2017-08-15  142.550003  143.339996  140.580002  142.070007  142.070007
 2017-08-16  141.789993  142.910004  141.610001  142.500000  142.500000
 2017-08-17  142.520004  142.889999  140.699997  140.699997  140.699997
 2017-08-18  140.869995  141.149994  139.580002  139.699997  139.699997
 2017-08-21  139.589996  140.419998  139.130005  140.330002  140.330002
 2017-08-22  140.639999  141.149994  140.380005  141.009995  141.009995
 2017-08-23  140.699997  143.050003  140.679993  142.139999  142.139999
 2017-08-24  142.500000  143.679993  142.250000  142.940002  142.940002
 2017-08-25  143.300003  144.190002  143.250000  143.740005  143.740005
 2017-08-28  144.110001  144.559998  142.389999  142.509995  142.509995
 2017-08-29  142.100006  143.429993  141.899994  143.139999  143.139999
 2017-08-30  143.259995  143.279999  142.410004  142.559998  142.559998
 2017-08-31  143.020004  143.660004  142.630005  143.029999  143.029999
 2017-09-01  142.979996  144.500000  142.979996  144.080002  144.080002

               Volume
 Date
 2010-01-04   6155300
 2010-01-05   6841400
 2010-01-06   5605300
 2010-01-07   5840600
 2010-01-08   4197200
 2010-01-11   5730400
 2010-01-12   8081500
 2010-01-13   6455400
 2010-01-14   7111800
 2010-01-15   8494400
 2010-01-19  13916200
 2010-01-20  15197500
 2010-01-21   9608600
 2010-01-22  10088600
 2010-01-25   5738500
 2010-01-26   7135300
 2010-01-27   8719200
 2010-01-28   9622200
 2010-01-29  11571200
 2010-02-01   7242900
 2010-02-02   5899900
 2010-02-03   4177100
 2010-02-04   9126900
 2010-02-05   8617000
 2010-02-08   5718500
 2010-02-09   6044500
 2010-02-10   5219100
 2010-02-11   5089000
 2010-02-12   8017700
 2010-02-16   6777300
 ...              ...
 2017-07-24   3877600
 2017-07-25   4208900
 2017-07-26   3932400
 2017-07-27   6430800
 2017-07-28   3054800
 2017-07-31   4355700
 2017-08-01   3219500
 2017-08-02   3540900
 2017-08-03   3035400
 2017-08-04   2549400
 2017-08-07   4618300
 2017-08-08   3298700
 2017-08-09   2925800
 2017-08-10   4525400
 2017-08-11   3004000
 2017-08-14   2222300
 2017-08-15   4681500
 2017-08-16   3287800
 2017-08-17   4422100
 2017-08-18   4152700
 2017-08-21   3190700
 2017-08-22   2544400
 2017-08-23   4048300
 2017-08-24   3592200
 2017-08-25   2872900
 2017-08-28   5134500
 2017-08-29   3009500
 2017-08-30   2736000
 2017-08-31   3656400
 2017-09-01   3348500

 [1931 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close  Adj Close     Volume
 Date
 2010-01-04  30.620001  31.100000  30.590000  30.950001  25.275177   38409100
 2010-01-05  30.850000  31.100000  30.639999  30.959999  25.283342   49749600
 2010-01-06  30.879999  31.080000  30.520000  30.770000  25.128178   58182400
 2010-01-07  30.629999  30.700001  30.190001  30.450001  24.866852   50559700
 2010-01-08  30.280001  30.879999  30.240000  30.660000  25.038349   51197400
 2010-01-11  30.709999  30.760000  30.120001  30.270000  24.719858   68754700
 2010-01-12  30.150000  30.400000  29.910000  30.070000  24.556530   65912100
 2010-01-13  30.260000  30.520000  30.010000  30.350000  24.785191   51863500
 2010-01-14  30.309999  31.100000  30.260000  30.959999  25.283342   63228100
 2010-01-15  31.080000  31.240000  30.709999  30.860001  25.201679   79913200
 2010-01-19  30.750000  31.240000  30.680000  31.100000  25.397671   46575700
 2010-01-20  30.809999  30.940001  30.309999  30.590000  24.981182   54849500
 2010-01-21  30.610001  30.719999  30.000000  30.010000  24.507528   73086700
 2010-01-22  30.000000  30.200001  28.840000  28.959999  23.650047  102004600
 2010-01-25  29.240000  29.660000  29.100000  29.320000  23.944042   63373000
 2010-01-26  29.200001  29.850000  29.090000  29.500000  24.091042   66639900
 2010-01-27  29.350000  29.820000  29.020000  29.670000  24.229874   63949500
 2010-01-28  29.840000  29.870001  28.889999  29.160000  23.813379  117513700
 2010-01-29  29.900000  29.920000  27.660000  28.180000  23.013071  193888500
 2010-02-01  28.389999  28.480000  27.920000  28.410000  23.200891   85931100
 2010-02-02  28.370001  28.500000  28.139999  28.459999  23.241730   54413700
 2010-02-03  28.260000  28.790001  28.120001  28.629999  23.380560   61397900
 2010-02-04  28.379999  28.500000  27.809999  27.840000  22.735409   77850000
 2010-02-05  28.000000  28.280001  27.570000  28.020000  22.882408   80960100
 2010-02-08  28.010000  28.080000  27.570000  27.719999  22.637409   52820600
 2010-02-09  27.969999  28.340000  27.750000  28.010000  22.874241   59195800
 2010-02-10  28.030001  28.240000  27.840000  27.990000  22.857906   48591300
 2010-02-11  27.930000  28.400000  27.700001  28.120001  22.964071   65993700

In [103]:
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.items()})

In [104]:
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

web에서 .. .. 야후 금융사이트에 접속해서 주식data를 가져온다.
[참고사이트]<br/>
파이썬으로 배우는 알고리즘<br/>
https://wikidocs.net/4370<br/>

In [105]:
returns = price.pct_change()
returns.tail(10)

                AAPL      GOOG       IBM      MSFT
Date
2017-08-21 -0.001841 -0.004403  0.004510 -0.004690
2017-08-22  0.016348  0.019886  0.004846  0.013999
2017-08-23  0.001252  0.002498  0.008014 -0.006014
2017-08-24 -0.004438 -0.006170  0.005628 -0.000413
2017-08-25  0.003704 -0.005851  0.005597  0.001788
2017-08-28  0.010071 -0.002271 -0.008557  0.000137
2017-08-29  0.008918  0.008185  0.004421  0.003021
2017-08-30  0.002701  0.008987 -0.004052  0.013142
2017-08-31  0.003979  0.010499  0.003297  0.010269
2017-09-01  0.000305 -0.002119  0.007341 -0.011101

returns.tail()의 default는 5건이다.

In [106]:
returns.MSFT.corr(returns.IBM)

0.48300904568365077

In [107]:
returns.MSFT.cov(returns.IBM)

8.0518452845229066e-05

In [108]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.414090  0.367990  0.394345
GOOG  0.414090  1.000000  0.391414  0.476315
IBM   0.367990  0.391414  1.000000  0.483009
MSFT  0.394345  0.476315  0.483009  1.000000

In [109]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000259  0.000102  0.000070  0.000090
GOOG  0.000102  0.000234  0.000071  0.000103
IBM   0.000070  0.000071  0.000139  0.000081
MSFT  0.000090  0.000103  0.000081  0.000200

In [110]:
returns.corrwith(returns.IBM)

AAPL    0.367990
GOOG    0.391414
IBM     1.000000
MSFT    0.483009
dtype: float64

In [111]:
returns.corrwith(volume)

AAPL   -0.072689
GOOG   -0.014020
IBM    -0.210648
MSFT   -0.090433
dtype: float64

### Unique values, value counts, and membership

In [112]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [113]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [114]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

도수를 구하고, 값은 정렬되어서 나온다.

In [115]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [116]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [117]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [118]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [119]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [120]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [121]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [122]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [124]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [125]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [126]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [127]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [128]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [129]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [130]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [132]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df

          0         1         2
0  0.286350       NaN       NaN
1  0.331286       NaN       NaN
2  0.246674       NaN       NaN
3  1.327195       NaN -1.549106
4  0.022185       NaN -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

loc는 rable의 경우, 인덱스 숫자값은 iloc

In [133]:
df.dropna(thresh=3)

          0         1         2
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

### Filling in missing data

In [134]:
df.fillna(0)

          0         1         2
0  0.286350  0.000000  0.000000
1  0.331286  0.000000  0.000000
2  0.246674  0.000000  0.000000
3  1.327195  0.000000 -1.549106
4  0.022185  0.000000 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [135]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.286350  0.500000       NaN
1  0.331286  0.500000       NaN
2  0.246674  0.500000       NaN
3  1.327195  0.500000 -1.549106
4  0.022185  0.500000 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [137]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.286350  0.000000  0.000000
1  0.331286  0.000000  0.000000
2  0.246674  0.000000  0.000000
3  1.327195  0.000000 -1.549106
4  0.022185  0.000000 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [138]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642       NaN  1.001543
3 -0.503087       NaN -0.921169
4 -0.726213       NaN       NaN
5 -1.157719       NaN       NaN

In [139]:
df.fillna(method='ffill')

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642 -1.332610  1.001543
3 -0.503087 -1.332610 -0.921169
4 -0.726213 -1.332610 -0.921169
5 -1.157719 -1.332610 -0.921169

In [140]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642 -1.332610  1.001543
3 -0.503087 -1.332610 -0.921169
4 -0.726213       NaN -0.921169
5 -1.157719       NaN -0.921169

In [141]:
data = Series([1., NA, 3.5, NA, 7])
data.mean()

3.8333333333333335

In [142]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [145]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    1.010737
   2    1.824875
   3   -0.997518
b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
d  2   -0.114928
   3    2.003697
dtype: float64

인덱스에 레벨이 있다.

In [146]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [147]:
data['b']

1    0.850591
2   -0.131578
3    0.912414
dtype: float64

In [148]:
data['b':'c']

b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
dtype: float64

In [150]:
data.loc[['b', 'd']]

b  1    0.850591
   2   -0.131578
   3    0.912414
d  2   -0.114928
   3    2.003697
dtype: float64

In [151]:
data[:, 2]

a    1.824875
b   -0.131578
c    2.169461
d   -0.114928
dtype: float64

In [152]:
data.unstack()

          1         2         3
a  1.010737  1.824875 -0.997518
b  0.850591 -0.131578  0.912414
c  0.188211  2.169461       NaN
d       NaN -0.114928  2.003697

In [153]:
data.unstack().stack()

a  1    1.010737
   2    1.824875
   3   -0.997518
b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
d  2   -0.114928
   3    2.003697
dtype: float64

In [154]:
s = Series([3, 8, 2, 0, 3, 5], index=list('abcdef')); s

a    3
b    8
c    2
d    0
e    3
f    5
dtype: int64

In [156]:
Series.unstack?

In [157]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [158]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [159]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [166]:
frame
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [165]:
#frame.sortlevel(1)
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [167]:
#frame.swaplevel(0, 1).sortlevel(0)
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [168]:
frame
frame.sum(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [169]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [170]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [171]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [172]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [173]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [174]:
ser = Series(np.arange(3.))
ser.iloc[-1]
#ser[-1]

2.0

In [175]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [179]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2
ser2.iloc[-1] # iloc 위치값

a    0.0
b    1.0
c    2.0
dtype: float64

2.0

In [177]:
ser.loc[:1]
#레이블인 경우 1도 포함한다.

0    0.0
1    1.0
dtype: float64

In [181]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3
ser3.iloc[2]
ser3.loc[-5]

-5    0
 1    1
 3    2
dtype: int32

2

0

In [184]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame
frame.iloc[0]

   0  1
2  0  1
0  2  3
1  4  5

0    0
1    1
Name: 2, dtype: int32

### Panel data

In [188]:
#import pandas.io.data as web
import pandas_datareader as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'IBM']))

In [189]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1931 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: Open to Volume

Dimensions로 3차원 데이터라는 것을 확인 할 수 있다.

In [191]:
pdata = pdata.swapaxes('items', 'minor')
pdata

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1931 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2010-01-04 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [192]:
pdata['Adj Close']

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.505054  312.204773  109.173752  25.275177
2010-01-05   27.552608  310.829926  107.854950  25.283342
2010-01-06   27.114347  302.994293  107.154320  25.128178
2010-01-07   27.064222  295.940735  106.783417  24.866852
2010-01-08   27.244156  299.885956  107.854950  25.038349
2010-01-11   27.003820  299.432648  106.725700  24.719858
2010-01-12   26.696650  294.137512  107.574692  24.556530
2010-01-13   27.073221  292.448822  107.343887  24.785191
2010-01-14   26.916422  293.823669  109.058350  25.283342
2010-01-15   26.466595  288.917053  108.621490  25.201679
2010-01-19   27.637430  292.712830  110.566757  25.397671
2010-01-20   27.212029  289.121307  107.360382  24.981182
2010-01-21   26.741631  290.401489  106.330040  24.507528
2010-01-22   25.415281  273.978058  103.445122  23.650047
2010-01-25   26.099028  268.991760  103.956169  23.944042
2010-01-26   26.467880  270.197235  103.651207  24.091042
2010-01-27   26.717218  270.037842  104.129272  24.229874
2010-01-28   25.613209  266.147400  102.002670  23.813379
2010-01-29   24.683992  263.980530  100.881660  23.013071
2010-02-01   25.027143  265.514771  102.760971  23.200891
2010-02-02   25.172379  264.568329  103.469849  23.241730
2010-02-03   25.605494  269.400208  103.577019  23.380560
2010-02-04   24.682707  262.406433  101.384453  22.735409
2010-02-05   25.120964  264.653015  101.813095  22.882408
2010-02-08   24.948748  265.738953  100.910622  22.637409
2010-02-09   25.214790  267.218414  102.011803  22.874241
2010-02-10   25.077271  266.227112  101.680611  22.857906
2010-02-11   25.533520  267.198486  102.442314  22.964071
2010-02-12   25.753294  265.564606  102.665886  22.808908
2010-02-16   26.141434  269.639313  103.684265  23.260166
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1931 rows x 4 columns]

In [193]:
pdata.loc[:, '6/1/2012', :]

            Open        High         Low       Close   Adj Close       Volume
AAPL   81.308571   81.807144   80.074287   80.141426   72.099739  130246900.0
GOOG  284.827393  285.255798  283.113831  284.423920  284.423920    6138700.0
IBM   190.119995  191.720001  188.600006  189.080002  162.828171    5206400.0
MSFT   28.760000   28.959999   28.440001   28.450001   24.668653   56634300.0

In [194]:
pdata.loc['Adj Close', '5/22/2012':, :]

                  AAPL        GOOG         IBM       MSFT
Date
2012-05-22   71.583061  299.278229  169.493561  25.804539
2012-05-23   73.329674  303.592072  168.890732  25.240936
2012-05-24   72.656212  300.702881  168.864868  25.206251
2012-05-25   72.266800  294.660553  167.323425  25.197577
2012-05-29   73.549454  296.060303  169.183533  25.631123
2012-05-30   74.436249  293.016693  167.521484  25.440367
2012-05-31   74.251175  289.345459  166.117752  25.310303
2012-06-01   72.099739  284.423920  162.828171  24.668653
2012-06-04   72.523842  288.214691  162.363113  24.755363
2012-06-05   72.336205  284.139984  162.931534  24.720682
2012-06-06   73.445358  289.200989  167.056473  25.449030
2012-06-07   73.478767  288.035370  167.443970  25.344986
2012-06-08   74.584061  289.141235  168.046753  25.709158
2012-06-11   73.408081  283.188538  165.781921  25.058844
2012-06-12   74.049400  281.494873  167.538712  25.397011
2012-06-13   73.535316  279.497375  166.290054  25.258274
2012-06-14   73.454330  278.481171  168.012360  25.440367
2012-06-15   73.788521  281.200989  171.457001  26.029984
2012-06-18   75.285774  284.359161  170.759460  25.873913
2012-06-19   75.495277  289.679199  171.310577  26.619606
2012-06-20   75.280624  287.676727  171.181396  26.819031
2012-06-21   74.243469  281.549683  166.539749  26.134035
2012-06-22   74.812836  284.672974  166.806732  26.619606
2012-06-25   73.356667  279.303101  166.083328  25.899921
2012-06-26   73.518631  281.285675  165.299698  26.029984
2012-06-27   73.836052  283.587036  166.203903  26.160044
2012-06-28   73.135612  281.101349  164.826035  25.934605
2012-06-29   75.057014  288.951935  168.425720  26.524225
2012-07-02   76.152031  289.151184  168.640976  26.498209
2012-07-03   77.037544  292.817444  168.727112  26.671631
...                ...         ...         ...        ...
2017-07-24  151.495071  980.340027  144.463654  73.209946
2017-07-25  152.142548  950.700012  144.661560  73.796822
2017-07-26  152.859726  947.799988  143.840240  73.657562
2017-07-27  149.971069  934.090027  143.553284  72.772285
2017-07-28  148.915207  941.530029  142.781418  72.652916
2017-07-31  148.148224  930.500000  143.157455  72.314713
2017-08-01  149.463058  930.830017  143.780869  72.195358
2017-08-02  156.525330  930.390015  142.939758  71.877052
2017-08-03  154.961472  923.650024  143.424637  71.767632
2017-08-04  155.778259  927.960022  143.642334  72.294823
2017-08-07  158.188797  929.359985  141.970001  72.016312
2017-08-08  159.453827  926.789978  142.110001  72.404243
2017-08-09  160.429993  922.900024  141.770004  72.085938
2017-08-10  155.320007  907.239990  141.839996  71.031555
2017-08-11  157.479996  914.390015  141.839996  72.115776
2017-08-14  159.850006  922.669983  142.320007  73.199997
2017-08-15  161.600006  922.219971  142.070007  73.220001
2017-08-16  160.949997  926.960022  142.500000  73.650002
2017-08-17  157.860001  910.979980  140.699997  72.400002
2017-08-18  157.500000  910.669983  139.699997  72.489998
2017-08-21  157.210007  906.659973  140.330002  72.150002
2017-08-22  159.779999  924.690002  141.009995  73.160004
2017-08-23  159.979996  927.000000  142.139999  72.720001
2017-08-24  159.270004  921.280029  142.940002  72.690002
2017-08-25  159.860001  915.890015  143.740005  72.820000
2017-08-28  161.470001  913.809998  142.509995  72.830002
2017-08-29  162.910004  921.289978  143.139999  73.050003
2017-08-30  163.350006  929.570007  142.559998  74.010002
2017-08-31  164.000000  939.330017  143.029999  74.769997
2017-09-01  164.050003  937.340027  144.080002  73.940002

[1330 rows x 4 columns]

In [196]:
stacked = pdata.loc[:, '5/30/2012':, :].to_frame()
#frame으로 변환 왼쪽으로 늘어나면 stack 위쪽으로가 unstacK
stacked

                        Open        High         Low       Close   Adj Close  \
Date       minor
2012-05-30 AAPL    81.314285   82.855713   80.937141   82.738571   74.436249
           GOOG   292.981842  294.844849  290.675476  293.016693  293.016693
           IBM    194.800003  195.470001  193.770004  194.529999  167.521484
           MSFT    29.350000   29.480000   29.120001   29.340000   25.440367
2012-05-31 AAPL    82.962860   83.071426   81.637146   82.532860   74.251175
           GOOG   293.260773  293.898407  288.418945  289.345459  289.345459
           IBM    194.100006  194.929993  192.000000  192.899994  166.117752
           MSFT    29.299999   29.420000   28.940001   29.190001   25.310303
2012-06-01 AAPL    81.308571   81.807144   80.074287   80.141426   72.099739
           GOOG   284.827393  285.255798  283.113831  284.423920  284.423920
           IBM    190.119995  191.720001  188.600006  189.080002  162.828171
           MSFT    28.760000   28.959999   28.440001   28.450001   24.668653
2012-06-04 AAPL    80.214287   81.071426   78.357140   80.612854   72.523842
           GOOG   284.045319  289.161163  283.940735  288.214691  288.214691
           IBM    188.339996  189.380005  187.000000  188.539993  162.363113
           MSFT    28.620001   28.780001   28.320000   28.549999   24.755363
2012-06-05 AAPL    80.181427   80.924286   79.761429   80.404289   72.336205
           GOOG   286.650574  287.985565  282.177338  284.139984  284.139984
           IBM    187.919998  189.850006  187.559998  189.199997  162.931534
           MSFT    28.510000   28.750000   28.389999   28.510000   24.720682
2012-06-06 AAPL    81.110001   81.978569   80.785713   81.637146   73.445358
           GOOG   287.163635  289.898376  285.734009  289.200989  289.200989
           IBM    190.779999  194.000000  190.020004  193.990005  167.056473
           MSFT    28.879999   29.370001   28.809999   29.350000   25.449030
2012-06-07 AAPL    82.470001   82.474289   81.500000   81.674286   73.478767
           GOOG   292.702881  292.847351  287.547211  288.035370  288.035370
           IBM    195.279999  195.830002  193.940002  194.440002  167.443970
           MSFT    29.639999   29.700001   29.170000   29.230000   25.344986
2012-06-08 AAPL    81.657143   82.940002   81.285713   82.902855   74.584061
           GOOG   286.849823  289.415192  286.217194  289.141235  289.141235
...                      ...         ...         ...         ...         ...
2017-08-23 IBM    140.699997  143.050003  140.679993  142.139999  142.139999
           MSFT    72.959999   73.150002   72.529999   72.720001   72.720001
2017-08-24 AAPL   160.429993  160.740005  158.550003  159.270004  159.270004
           GOOG   928.659973  930.840027  915.500000  921.280029  921.280029
           IBM    142.500000  143.679993  142.250000  142.940002  142.940002
           MSFT    72.739998   72.860001   72.070000   72.690002   72.690002
2017-08-25 AAPL   159.649994  160.559998  159.270004  159.860001  159.860001
           GOOG   923.489990  925.554993  915.500000  915.890015  915.890015
           IBM    143.300003  144.190002  143.250000  143.740005  143.740005
           MSFT    72.860001   73.349998   72.480003   72.820000   72.820000
2017-08-28 AAPL   160.139999  162.000000  159.929993  161.470001  161.470001
           GOOG   916.000000  919.244995  911.869995  913.809998  913.809998
           IBM    144.110001  144.559998  142.389999  142.509995  142.509995
           MSFT    73.059998   73.089996   72.550003   72.830002   72.830002
2017-08-29 AAPL   160.100006  163.119995  160.000000  162.910004  162.910004
           GOOG   905.099976  923.330017  905.000000  921.289978  921.289978
           IBM    142.100006  143.429993  141.899994  143.139999  143.139999
           MSFT    72.250000   73.160004   72.050003   73.050003   73.050003
2017-08-30 AAPL   163.800003  163.889999  162.610001  163.350006  163.350006
           GOOG   920.049988  930.818970  919.650024  929.570007  929.570007
           IBM    143.259995  143.279999  142.410004  142.559998  142.559998
           MSFT    73.010002   74.209999   72.830002   74.010002   74.010002
2017-08-31 AAPL   163.639999  164.520004  163.479996  164.000000  164.000000
           GOOG   931.760010  941.979980  931.760010  939.330017  939.330017
           IBM    143.020004  143.660004  142.630005  143.029999  143.029999
           MSFT    74.029999   74.959999   73.800003   74.769997   74.769997
2017-09-01 AAPL   164.800003  164.940002  163.630005  164.050003  164.050003
           GOOG   941.130005  942.479980  935.150024  937.340027  937.340027
           IBM    142.979996  144.500000  142.979996  144.080002  144.080002
           MSFT    74.709999   74.739998   73.639999   73.940002   73.940002

                       Volume
Date       minor
2012-05-30 AAPL   132357400.0
           GOOG     3827600.0
           IBM      3602500.0
           MSFT    41585500.0
2012-05-31 AAPL   122918600.0
           GOOG     5958800.0
           IBM      9287500.0
           MSFT    39134000.0
2012-06-01 AAPL   130246900.0
           GOOG     6138700.0
           IBM      5206400.0
           MSFT    56634300.0
2012-06-04 AAPL   139248900.0
           GOOG     4883500.0
           IBM      4624500.0
           MSFT    47926300.0
2012-06-05 AAPL    97053600.0
           GOOG     4697200.0
           IBM      3556500.0
           MSFT    45715400.0
2012-06-06 AAPL   100363900.0
           GOOG     4207200.0
           IBM      3641300.0
           MSFT    46860500.0
2012-06-07 AAPL    94941700.0
           GOOG     3530100.0
           IBM      3701100.0
           MSFT    37792800.0
2012-06-08 AAPL    86879100.0
           GOOG     2831300.0
...                       ...
2017-08-23 IBM      4048300.0
           MSFT    13766500.0
2017-08-24 AAPL    19818900.0
           GOOG     1270300.0
           IBM      3592200.0
           MSFT    17098300.0
2017-08-25 AAPL    25480100.0
           GOOG     1053400.0
           IBM      2872900.0
           MSFT    12794300.0
2017-08-28 AAPL    25966000.0
           GOOG     1086500.0
           IBM      5134500.0
           MSFT    14569700.0
2017-08-29 AAPL    29516900.0
           GOOG     1185600.0
           IBM      3009500.0
           MSFT    11478400.0
2017-08-30 AAPL    27269600.0
           GOOG     1301200.0
           IBM      2736000.0
           MSFT    16897800.0
2017-08-31 AAPL    26785100.0
           GOOG     1582600.0
           IBM      3656400.0
           MSFT    27652800.0
2017-09-01 AAPL    16552800.0
           GOOG      915900.0
           IBM      3348500.0
           MSFT    21706200.0

[5300 rows x 6 columns]

In [197]:
stacked.to_panel()

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  """Entry point for launching an IPython kernel.

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1325 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2017-09-01 00:00:00
Minor_axis axis: AAPL to MSFT